lovelyboysaybye/SmartBottleCreator/SmartBottle_v0p1/SmartBottle_v0p1.cydsn/Generated_Source/PSoC6/CapSense_Configuration.h
/*******************************************************************************
* Button0 initialization values for RAM data structure
*******************************************************************************/
#define CapSense_BUTTON0_RESOLUTION             (CapSense_RES16BIT)
#define CapSense_BUTTON0_FINGER_TH              (2500u)
#define CapSense_BUTTON0_NOISE_TH               (200u)
#define CapSense_BUTTON0_NNOISE_TH              (200u)
#define CapSense_BUTTON0_HYSTERESIS             (10u)
#define CapSense_BUTTON0_ON_DEBOUNCE            (3u)
#define CapSense_BUTTON0_LOW_BSLN_RST           (30u)
#define CapSense_BUTTON0_IDAC_MOD0              (32u)
#define CapSense_BUTTON0_SNS_CLK                (16u)
#define CapSense_BUTTON0_SNS_CLK_SOURCE         (0u)

/*******************************************************************************
* Button1 initialization values for FLASH data structure
*******************************************************************************/
#define CapSense_BUTTON1_STATIC_CONFIG          (10241u)
#define CapSense_BUTTON1_NUM_SENSORS            (1u)

/*******************************************************************************
* Button1 initialization values for RAM data structure
*******************************************************************************/
#define CapSense_BUTTON1_RESOLUTION             (CapSense_RES16BIT)
#define CapSense_BUTTON1_FINGER_TH              (2500u)
#define CapSense_BUTTON1_NOISE_TH               (200u)
#define CapSense_BUTTON1_NNOISE_TH              (200u)
#define CapSense_BUTTON1_HYSTERESIS             (10u)
#define CapSense_BUTTON1_ON_DEBOUNCE            (3u)
#define CapSense_BUTTON1_LOW_BSLN_RST           (30u)
#define CapSense_BUTTON1_IDAC_MOD0              (32u)
#define CapSense_BUTTON1_SNS_CLK                (16u)
#define CapSense_BUTTON1_SNS_CLK_SOURCE         (0u)

/*******************************************************************************
* Button2 initialization values for FLASH data structure
*******************************************************************************/
#define CapSense_BUTTON2_STATIC_CONFIG          (10241u)
#define CapSense_BUTTON2_NUM_SENSORS            (1u)

/*******************************************************************************
* Button2 initialization values for RAM data structure
*******************************************************************************/
#define CapSense_BUTTON2_RESOLUTION             (CapSense_RES16BIT)
#define CapSense_BUTTON2_FINGER_TH              (2500u)
#define CapSense_BUTTON2_NOISE_TH               (200u)
#define CapSense_BUTTON2_NNOISE_TH              (200u)
#define CapSense_BUTTON2_HYSTERESIS             (10u)
#define CapSense_BUTTON2_ON_DEBOUNCE            (3u)
#define CapSense_BUTTON2_LOW_BSLN_RST           (30u)
#define CapSense_BUTTON2_IDAC_MOD0              (32u)
#define CapSense_BUTTON2_SNS_CLK                (16u)
#define CapSense_BUTTON2_SNS_CLK_SOURCE         (0u)

/*******************************************************************************
* Button3 initialization values for FLASH data structure
*******************************************************************************/
#define CapSense_BUTTON3_STATIC_CONFIG          (10241u)
#define CapSense_BUTTON3_NUM_SENSORS            (1u)

/*******************************************************************************
* Button3 initialization values for RAM data structure
*******************************************************************************/
#define CapSense_BUTTON3_RESOLUTION             (CapSense_RES16BIT)
#define CapSense_BUTTON3_FINGER_TH              (2500u)
#define CapSense_BUTTON3_NOISE_TH               (200u)
#define CapSense_BUTTON3_NNOISE_TH              (200u)
#define CapSense_BUTTON3_HYSTERESIS             (10u)
#define CapSense_BUTTON3_ON_DEBOUNCE            (3u)
#define CapSense_BUTTON3_LOW_BSLN_RST           (30u)
#define CapSense_BUTTON3_IDAC_MOD0              (32u)
#define CapSense_BUTTON3_SNS_CLK                (16u)
#define CapSense_BUTTON3_SNS_CLK_SOURCE         (0u)

/*******************************************************************************
* Button4 initialization values for FLASH data structure
*******************************************************************************/
#define CapSense_BUTTON4_STATIC_CONFIG          (10241u)
#define CapSense_BUTTON4_NUM_SENSORS            (1u)

/*******************************************************************************
* Button4 initialization values for RAM data structure
*******************************************************************************/
#define CapSense_BUTTON4_RESOLUTION             (CapSense_RES16BIT)
#define CapSense_BUTTON4_FINGER_TH              (2500u)
#define CapSense_BUTTON4_NOISE_TH               (200u)
#define CapSense_BUTTON4_NNOISE_TH              (200u)
#define CapSense_BUTTON4_HYSTERESIS             (10u)
#define CapSense_BUTTON4_ON_DEBOUNCE            (3u)
#define CapSense_BUTTON4_LOW_BSLN_RST           (30u)
#define CapSense_BUTTON4_IDAC_MOD0              (32u)
#define CapSense_BUTTON4_SNS_CLK                (16u)
#define CapSense_BUTTON4_SNS_CLK_SOURCE         (0u)

/*******************************************************************************
* Button5 initialization values for FLASH data structure
*******************************************************************************/
#define CapSense_BUTTON5_STATIC_CONFIG          (10241u)
#define CapSense_BUTTON5_NUM_SENSORS            (1u)

/*******************************************************************************
* Button5 initialization values for RAM data structure
*******************************************************************************/
#define CapSense_BUTTON5_RESOLUTION             (CapSense_RES16BIT)
#define CapSense_BUTTON5_FINGER_TH              (2500u)
#define CapSense_BUTTON5_NOISE_TH               (200u)
#define CapSense_BUTTON5_NNOISE_TH              (200u)
#define CapSense_BUTTON5_HYSTERESIS             (10u)
#define CapSense_BUTTON5_ON_DEBOUNCE            (3u)
#define CapSense_BUTTON5_LOW_BSLN_RST           (30u)
#define CapSense_BUTTON5_IDAC_MOD0              (32u)
#define CapSense_BUTTON5_SNS_CLK                (16u)
#define CapSense_BUTTON5_SNS_CLK_SOURCE         (0u)

