lovelyboysaybye/SmartBottleCreator/SmartBottle_v0p1/SmartBottle_v0p1.cydsn/Generated_Source/PSoC6/CapSense_Configuration.h
/*******************************************************************************
* Button6 initialization values for FLASH data structure
*******************************************************************************/
#define CapSense_BUTTON6_STATIC_CONFIG          (10241u)
#define CapSense_BUTTON6_NUM_SENSORS            (1u)

/*******************************************************************************
* Button6 initialization values for RAM data structure
*******************************************************************************/
#define CapSense_BUTTON6_RESOLUTION             (CapSense_RES16BIT)
#define CapSense_BUTTON6_FINGER_TH              (2500u)
#define CapSense_BUTTON6_NOISE_TH               (200u)
#define CapSense_BUTTON6_NNOISE_TH              (200u)
#define CapSense_BUTTON6_HYSTERESIS             (10u)
#define CapSense_BUTTON6_ON_DEBOUNCE            (3u)
#define CapSense_BUTTON6_LOW_BSLN_RST           (30u)
#define CapSense_BUTTON6_IDAC_MOD0              (32u)
#define CapSense_BUTTON6_SNS_CLK                (16u)
#define CapSense_BUTTON6_SNS_CLK_SOURCE         (0u)

/*******************************************************************************
* Button7 initialization values for FLASH data structure
*******************************************************************************/
#define CapSense_BUTTON7_STATIC_CONFIG          (10241u)
#define CapSense_BUTTON7_NUM_SENSORS            (1u)

/*******************************************************************************
* Button7 initialization values for RAM data structure
*******************************************************************************/
#define CapSense_BUTTON7_RESOLUTION             (CapSense_RES16BIT)
#define CapSense_BUTTON7_FINGER_TH              (2500u)
#define CapSense_BUTTON7_NOISE_TH               (200u)
#define CapSense_BUTTON7_NNOISE_TH              (200u)
#define CapSense_BUTTON7_HYSTERESIS             (10u)
#define CapSense_BUTTON7_ON_DEBOUNCE            (3u)
#define CapSense_BUTTON7_LOW_BSLN_RST           (30u)
#define CapSense_BUTTON7_IDAC_MOD0              (32u)
#define CapSense_BUTTON7_SNS_CLK                (16u)
#define CapSense_BUTTON7_SNS_CLK_SOURCE         (0u)

/*******************************************************************************
* Button8 initialization values for FLASH data structure
*******************************************************************************/
#define CapSense_BUTTON8_STATIC_CONFIG          (10241u)
#define CapSense_BUTTON8_NUM_SENSORS            (1u)

/*******************************************************************************
* Button8 initialization values for RAM data structure
*******************************************************************************/
#define CapSense_BUTTON8_RESOLUTION             (CapSense_RES16BIT)
#define CapSense_BUTTON8_FINGER_TH              (2500u)
#define CapSense_BUTTON8_NOISE_TH               (200u)
#define CapSense_BUTTON8_NNOISE_TH              (200u)
#define CapSense_BUTTON8_HYSTERESIS             (10u)
#define CapSense_BUTTON8_ON_DEBOUNCE            (3u)
#define CapSense_BUTTON8_LOW_BSLN_RST           (30u)
#define CapSense_BUTTON8_IDAC_MOD0              (32u)
#define CapSense_BUTTON8_SNS_CLK                (16u)
#define CapSense_BUTTON8_SNS_CLK_SOURCE         (0u)

/*******************************************************************************
* Button9 initialization values for FLASH data structure
*******************************************************************************/
#define CapSense_BUTTON9_STATIC_CONFIG          (10241u)
#define CapSense_BUTTON9_NUM_SENSORS            (1u)

/*******************************************************************************
* Button9 initialization values for RAM data structure
*******************************************************************************/
#define CapSense_BUTTON9_RESOLUTION             (CapSense_RES16BIT)
#define CapSense_BUTTON9_FINGER_TH              (2500u)
#define CapSense_BUTTON9_NOISE_TH               (200u)
#define CapSense_BUTTON9_NNOISE_TH              (200u)
#define CapSense_BUTTON9_HYSTERESIS             (10u)
#define CapSense_BUTTON9_ON_DEBOUNCE            (3u)
#define CapSense_BUTTON9_LOW_BSLN_RST           (30u)
#define CapSense_BUTTON9_IDAC_MOD0              (32u)
#define CapSense_BUTTON9_SNS_CLK                (16u)
#define CapSense_BUTTON9_SNS_CLK_SOURCE         (0u)

/* RAM Sensor Parameters Definitions */


/*******************************************************************************
* ADC Specific Macros
*******************************************************************************/
#define CapSense_ADC_RES8BIT                  (8u)
#define CapSense_ADC_RES10BIT                 (10u)

#define CapSense_ADC_FULLRANGE_MODE           (0u)
#define CapSense_ADC_VREF_MODE                (1u)

#define CapSense_ADC_MIN_CHANNELS             (1u)
#define CapSense_ADC_EN                       (0u)
#define CapSense_ADC_STANDALONE_EN            (0u)
#define CapSense_ADC_TOTAL_CHANNELS           (0u)
#define CapSense_ADC_RESOLUTION               (CapSense_ADC_RES10BIT)
#define CapSense_ADC_AMUXB_INPUT_EN           (0u)
#define CapSense_ADC_SELECT_AMUXB_CH          (0u)
#define CapSense_ADC_AZ_EN                    (1Lu)
#define CapSense_ADC_AZ_TIME                  (5u)
#define CapSense_ADC_VREF_MV                  (2133u)
#define CapSense_ADC_GAIN                     (11Lu)
#define CapSense_ADC_IDAC_DEFAULT             (16u)
#define CapSense_ADC_MODCLK_DIV_DEFAULT       (1u)
#define CapSense_ADC_MEASURE_MODE             (CapSense_ADC_FULLRANGE_MODE)
#define CapSense_ADC_ANALOG_STARTUP_DELAY_US  (23u)

/*******************************************************************************
* Built-In Self-Test Configuration
*******************************************************************************/
#define CapSense_SELF_TEST_EN                   (0Lu)
#define CapSense_TST_GLOBAL_CRC_EN              (0Lu)
#define CapSense_TST_WDGT_CRC_EN                (0Lu)
#define CapSense_TST_BSLN_DUPLICATION_EN        (0Lu)
#define CapSense_TST_BSLN_RAW_OUT_RANGE_EN      (0Lu)
#define CapSense_TST_SNS_SHORT_EN               (0Lu)
#define CapSense_TST_SNS2SNS_SHORT_EN           (0Lu)
#define CapSense_TST_SNS_CAP_EN                 (0Lu)
#define CapSense_TST_SH_CAP_EN                  (0Lu)
#define CapSense_TST_EXTERNAL_CAP_EN            (0Lu)
#define CapSense_TST_INTERNAL_CAP_EN            (0Lu)
#define CapSense_TST_VDDA_EN                    (0Lu)
#define CapSense_TST_FINE_INIT_TIME             (1Lu)


#define CapSense_TST_ANALOG_STARTUP_DELAY_US    (23u)

/*******************************************************************************
* Gesture Configuration
*******************************************************************************/
#define CapSense_TIMESTAMP_INTERVAL             (1Lu)
#define CapSense_GESTURE_EN_WIDGET_ID           (0Lu)
#define CapSense_BALLISTIC_EN_WIDGET_ID         (0Lu)


#endif /* CY_SENSE_CapSense_CONFIGURATION_H */


/* [] END OF FILE */
